In [87]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score
from sklearn.tree import DecisionTreeRegressor
from sklearn.metrics import mean_squared_error

In [88]:
train=pd.read_csv("sales_train.csv.gz")

In [89]:
train.head(10)

         date  date_block_num  shop_id  item_id  item_price  item_cnt_day
0  02.01.2013               0       59    22154      999.00           1.0
1  03.01.2013               0       25     2552      899.00           1.0
2  05.01.2013               0       25     2552      899.00          -1.0
3  06.01.2013               0       25     2554     1709.05           1.0
4  15.01.2013               0       25     2555     1099.00           1.0
5  10.01.2013               0       25     2564      349.00           1.0
6  02.01.2013               0       25     2565      549.00           1.0
7  04.01.2013               0       25     2572      239.00           1.0
8  11.01.2013               0       25     2572      299.00           1.0
9  03.01.2013               0       25     2573      299.00           3.0

In [90]:
train.shape

(2935849, 6)

In [91]:
test=pd.read_csv("test.csv.gz")

In [92]:
test.head(10)

   ID  shop_id  item_id
0   0        5     5037
1   1        5     5320
2   2        5     5233
3   3        5     5232
4   4        5     5268
5   5        5     5039
6   6        5     5041
7   7        5     5046
8   8        5     5319
9   9        5     5003

In [93]:
test.shape

(214200, 3)

In [94]:
items=pd.read_csv("items.csv")

In [95]:
items.tail(10)

,item_name,item_id,item_category_id
22160,ЯРМАРКА ТЩЕСЛАВИЯ (Регион),22160,40
22161,ЯРОСЛАВ. ТЫСЯЧУ ЛЕТ НАЗАД э (BD),22161,37
22162,ЯРОСТЬ,22162,40
22163,ЯРОСТЬ ( регион),22163,40
22164,ЯРОСТЬ (BD),22164,37
22165,"Ядерный титбит 2 [PC, Цифровая версия]",22165,31
22166,Язык запросов 1С:Предприятия [Цифровая версия],22166,54
22167,Язык запросов 1С:Предприятия 8 (+CD). Хрустале...,22167,49
22168,Яйцо для Little Inu,22168,62
22169,Яйцо дракона (Игра престолов),22169,69

In [96]:
items.shape

(22170, 3)

In [97]:
categories=pd.read_csv("item_categories.csv")

In [98]:
categories.tail(10)

                      item_category_name  item_category_id
74               Программы - MAC (Цифра)                74
75          Программы - Для дома и офиса                75
76  Программы - Для дома и офиса (Цифра)                76
77                 Программы - Обучающие                77
78         Программы - Обучающие (Цифра)                78
79                             Служебные                79
80                    Служебные - Билеты                80
81               Чистые носители (шпиль)                81
82             Чистые носители (штучные)                82
83                      Элементы питания                83

In [99]:
categories.shape

(84, 2)

In [100]:
shops=pd.read_csv("shops.csv")

In [101]:
shops.head()

                        shop_name  shop_id
0   !Якутск Орджоникидзе, 56 фран        0
1   !Якутск ТЦ "Центральный" фран        1
2                Адыгея ТЦ "Мега"        2
3  Балашиха ТРК "Октябрь-Киномир"        3
4        Волжский ТЦ "Волга Молл"        4

In [102]:
shops.shape

(60, 2)

In [103]:
submission=pd.read_csv("sample_submission.csv.gz")

In [104]:
submission.head()

   ID  item_cnt_month
0   0             0.5
1   1             0.5
2   2             0.5
3   3             0.5
4   4             0.5

In [105]:
submission.shape

(214200, 2)

In [106]:
train.dtypes

date               object
date_block_num      int64
shop_id             int64
item_id             int64
item_price        float64
item_cnt_day      float64
dtype: object

In [107]:
df=pd.merge(items,train)
df.head()

,item_name,item_id,item_category_id,date,date_block_num,shop_id,item_price,item_cnt_day
0,! ВО ВЛАСТИ НАВАЖДЕНИЯ (ПЛАСТ.) D,0,40,01.09.2014,20,54,58.0,1.0
1,!ABBYY FineReader 12 Professional Edition Full...,1,76,04.04.2014,15,55,4490.0,1.0
2,!ABBYY FineReader 12 Professional Edition Full...,1,76,02.04.2014,15,55,4490.0,1.0
3,!ABBYY FineReader 12 Professional Edition Full...,1,76,06.07.2014,18,55,4490.0,1.0
4,!ABBYY FineReader 12 Professional Edition Full...,1,76,04.08.2014,19,55,4490.0,1.0

In [108]:
data=pd.merge(df,categories)
data.head()

,item_name,item_id,item_category_id,date,date_block_num,shop_id,item_price,item_cnt_day,item_category_name
0,! ВО ВЛАСТИ НАВАЖДЕНИЯ (ПЛАСТ.) D,0,40,01.09.2014,20,54,58.0,1.0,Кино - DVD
1,***В ЛУЧАХ СЛАВЫ (UNV) D,2,40,24.08.2014,19,54,58.0,1.0,Кино - DVD
2,***В ЛУЧАХ СЛАВЫ (UNV) D,2,40,12.11.2014,22,54,58.0,1.0,Кино - DVD
3,***ГОЛУБАЯ ВОЛНА (Univ) D,3,40,05.07.2014,18,54,100.0,1.0,Кино - DVD
4,***ГОЛУБАЯ ВОЛНА (Univ) D,3,40,26.08.2014,19,54,58.0,1.0,Кино - DVD

In [109]:
datas=pd.merge(data,shops)
datas.head()

,item_name,item_id,item_category_id,date,date_block_num,shop_id,item_price,item_cnt_day,item_category_name,shop_name
0,! ВО ВЛАСТИ НАВАЖДЕНИЯ (ПЛАСТ.) D,0,40,01.09.2014,20,54,58.0,1.0,Кино - DVD,"Химки ТЦ ""Мега"""
1,***В ЛУЧАХ СЛАВЫ (UNV) D,2,40,24.08.2014,19,54,58.0,1.0,Кино - DVD,"Химки ТЦ ""Мега"""
2,***В ЛУЧАХ СЛАВЫ (UNV) D,2,40,12.11.2014,22,54,58.0,1.0,Кино - DVD,"Химки ТЦ ""Мега"""
3,***ГОЛУБАЯ ВОЛНА (Univ) D,3,40,05.07.2014,18,54,100.0,1.0,Кино - DVD,"Химки ТЦ ""Мега"""
4,***ГОЛУБАЯ ВОЛНА (Univ) D,3,40,26.08.2014,19,54,58.0,1.0,Кино - DVD,"Химки ТЦ ""Мега"""

In [110]:
datas.keys()

Index(['item_name', 'item_id', 'item_category_id', 'date', 'date_block_num',
       'shop_id', 'item_price', 'item_cnt_day', 'item_category_name',
       'shop_name'],
      dtype='object')

In [111]:
datas.isnull().values.any()

False

In [112]:
datas=datas.drop(['item_name','item_category_name','date','item_price','shop_name'],axis=1)
datas.head()

   item_id  item_category_id  date_block_num  shop_id  item_cnt_day
0        0                40              20       54           1.0
1        2                40              19       54           1.0
2        2                40              22       54           1.0
3        3                40              18       54           1.0
4        3                40              19       54           1.0

In [113]:
datas.sort_values('date_block_num',axis=0,ascending=True)
datas.head()

   item_id  item_category_id  date_block_num  shop_id  item_cnt_day
0        0                40              20       54           1.0
1        2                40              19       54           1.0
2        2                40              22       54           1.0
3        3                40              18       54           1.0
4        3                40              19       54           1.0

In [114]:
datas.shape

(2935849, 5)

In [115]:
x=datas.iloc[:,[0,2,3]]
x.head()

   item_id  date_block_num  shop_id
0        0              20       54
1        2              19       54
2        2              22       54
3        3              18       54
4        3              19       54

In [116]:
y=datas.iloc[:,4]
y.head()

0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
Name: item_cnt_day, dtype: float64

In [117]:
x_train, x_test, y_train, y_test = train_test_split(x, y,test_size=0.2,random_state=15)

In [118]:
dt=DecisionTreeRegressor()

In [119]:
dt.fit(x_train,y_train)

DecisionTreeRegressor(criterion='mse', max_depth=None, max_features=None,
                      max_leaf_nodes=None, min_impurity_decrease=0.0,
                      min_impurity_split=None, min_samples_leaf=1,
                      min_samples_split=2, min_weight_fraction_leaf=0.0,
                      presort=False, random_state=None, splitter='best')

In [120]:
predictions=dt.predict(x_test)

In [121]:
predictions

array([1.        , 1.33333333, 1.        , ..., 1.        , 1.        ,
       1.        ])

In [122]:
prediction=pd.DataFrame(predictions,columns=['prediction']).to_csv('prediction.csv')

In [123]:
np.sqrt(mean_squared_error(y_test,predictions))

2.010840000705451

In [124]:
r2_score(y_test,predictions)

0.14343123496063426